Revit 2026 API

# FamilyManagerMakeType Method

---

Set the family parameter as a type parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void MakeType(
	FamilyParameter familyParameter
)
```
```vb
Public Sub MakeType (
	familyParameter As FamilyParameter
)
```
```cpp
public:
void MakeType(
	FamilyParameter^ familyParameter
)
```
```fsharp
member MakeType :
        familyParameter : FamilyParameter -> unit
```

#### Parameters

familyParameter FamilyParameter

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"familyParameter"-is . |
| ArgumentException | Thrown when the input argument-"familyParameter"-is an invalid parameter or a builtIn parameter. |

#### Reference

FamilyManager Class

Autodesk.Revit.DB Namespace